{
  "backend/main.mo": "Main ICP actor implementing user profile management, daily usage tracking, subscription tiers (free/pro), and UTR payment verification with role-based access control via MixinAuthorization.",
  "backend/migration.mo": "Simple migration module that transforms the old actor state (with an optional adminPrincipal) to a new empty actor state.",
  "feature_evidence.json": "Feature evidence report documenting the removal of initAdmin() and access-denied logic from AdminPanel.tsx, with associated test IDs and affected files.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to one-sentence summaries describing each file's purpose and notable changes.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property tokens for light and dark themes including colors, radius, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell that mounts the React app into a root div and loads the main TSX entry point as an ES module.",
  "frontend/src/App.tsx": "Root app component rendering a tabbed layout (Compressor, Converter, Toolbox, Subscription) with LoginHeader, sponsored ads, an AdminPanel route, and a LimitReachedModal.",
  "frontend/src/components/AdminPanel.tsx": "Admin panel component that immediately fetches pending UTR verifications on mount and renders approve controls, with all initAdmin and access-denied logic removed.",
  "frontend/src/components/AppHeader.tsx": "Static glassmorphism header displaying the FileForge logo, title, and badge labels for client-side processing and privacy.",
  "frontend/src/components/DropZone.tsx": "Reusable drag-and-drop file input component that handles drag events and click-to-browse, forwarding selected files via an onFiles callback.",
  "frontend/src/components/GlassCard.tsx": "Simple wrapper component applying glassmorphism card styling with optional glow effect and click handler.",
  "frontend/src/components/LimitReachedModal.tsx": "A modal dialog component that appears when a user exhausts their 4 free daily operations, prompting them to upgrade to a Pro subscription plan for ₹20/year.",
  "frontend/src/components/LoginHeader.tsx": "A sticky header component displaying the FileForge branding, privacy badges, and Internet Identity authentication controls (login/logout with principal ID display).",
  "frontend/src/components/SmartCompressor/SmartCompressor.tsx": "A file compression tool component supporting PDFs and images, with configurable lossy/lossless options, per-file status tracking, and batch download, gated by a daily usage limit.",
  "frontend/src/components/SubscriptionPanel.tsx": "A subscription management panel that shows free vs. Pro plan features, handles UPI payment flow via UTR submission, and reflects the user's current Pro/pending/free status from the backend.",
  "frontend/src/components/Toolbox/BackgroundRemover.tsx": "A toolbox component that accepts an image file, applies client-side background removal with an adjustable tolerance slider, and provides a before/after preview with download support.",
  "frontend/src/components/Toolbox/MetadataScrubber.tsx": "A toolbox component that strips EXIF, GPS, and other metadata from uploaded images and PDFs, processing files in batch and offering individual or bulk download of cleaned files.",
  "frontend/src/components/Toolbox/PDFMerger.tsx": "React component that allows users to upload, reorder, and merge multiple PDF files into one, with usage limit enforcement and download support.",
  "frontend/src/components/Toolbox/Toolbox.tsx": "Container component that renders a tool selector UI for three tools (PDF Merger, Background Remover, Metadata Scrubber) and displays the active tool's panel.",
  "frontend/src/components/UniversalConverter/UniversalConverter.tsx": "React component for converting files between formats (PDF, JPG, PNG, WEBP, DOCX, SVG) with batch processing, status tracking, and download support.",
  "frontend/src/contexts/FileContext.tsx": "React context that manages per-tab file state, providing add, remove, clear, and get operations for files across different app tabs.",
  "frontend/src/contexts/UsageContext.tsx": "React context that tracks daily tool usage against a limit of 4, syncing with a backend actor when authenticated and falling back to localStorage for anonymous users.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, initializing it with the user's Internet Identity or anonymously, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom hook and provider that manages Internet Identity authentication via DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend actor calls including verification status, UTR submission/approval, pro status, and daily usage queries.",
  "frontend/src/index.css": "Global stylesheet defining a dark glassmorphism theme with teal/emerald accents using Tailwind CSS, custom CSS variables, and reusable component classes like glass-card and drop-zone.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/backgroundRemoval.ts": "Implements client-side background removal using flood-fill from image corners on a canvas, with edge smoothing to produce a transparent-background PNG.",
  "frontend/src/utils/compression.ts": "Provides image compression utilities supporting lossy and lossless modes with targets by percentage reduction or max file size in KB, using binary search on canvas quality.",
  "frontend/src/utils/conversion.ts": "Handles file format conversion between image types (JPG, PNG, WEBP, SVG) and PDF-to-image using canvas rendering and dynamic pdf.js loading.",
  "frontend/src/utils/metadataScrubber.ts": "Strips metadata from images by redrawing on canvas and from PDFs using pdf-lib to clear title, author, and other document properties.",
  "frontend/src/utils/pdfMerger.ts": "Merges multiple PDF files into a single PDF blob using pdf-lib loaded dynamically from a CDN.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color palette (including teal, violet, chart, sidebar tokens), custom fonts, border radius, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state snapshot (version 29) describing a multi-tab file utility app with glassmorphism UI, client-side processing, UPI payment flow, Internet Identity auth, per-user canister storage, and a known issue with the daily uses counter not being incremented."
}