{
  "backend/main.mo": "Main Motoko actor implementing user profiles, daily usage tracking, subscription tiers (free/pro), and UTR payment verification with admin approval; uses an authorization mixin for role-based access control.",
  "feature_evidence.json": "Feature evidence report confirming that AdminPanel.tsx implements an access-denied guard that displays 'Access denied. Admin only.' when getPendingVerifications returns an access-denied error, without adding the /admin route to the main nav.",
  "frontend-file-summaries.txt": "JSON map of frontend source file summaries describing key changes across utilities, components, hooks, and contexts including type fixes, Pro status integration, and access-denied handling.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "Minimal HTML shell for the React app, mounting the root div and loading the main TSX entry point as an ES module.",
  "frontend/src/App.tsx": "Main app shell with four-tab navigation (Compressor, Converter, Toolbox, Subscription), a LoginHeader, sponsored ads, daily usage badge with Pro support, and a LimitReachedModal; AdminPanel is imported but not included in the tab bar.",
  "frontend/src/components/AdminPanel.tsx": "Admin panel component that fetches pending UTR verifications and renders them with approve controls; shows a centered 'Access denied. Admin only.' screen with a shield icon when the backend returns an access-denied error.",
  "frontend/src/components/AppHeader.tsx": "Static glassmorphism header component displaying the FileForge logo, title, and badge labels for client-side processing and privacy.",
  "frontend/src/components/DropZone.tsx": "Reusable drag-and-drop file input component with visual drag-over state, click-to-browse support, and configurable accept/multiple/label props.",
  "frontend/src/components/GlassCard.tsx": "Simple wrapper component applying glassmorphism styling with optional glow effect and click handler.",
  "frontend/src/components/LimitReachedModal.tsx": "A modal dialog component that appears when a user exhausts their 4 free daily operations, prompting them to upgrade to a Pro subscription plan for ₹20/year.",
  "frontend/src/components/LoginHeader.tsx": "A sticky header component displaying the FileForge branding, privacy badges, and Internet Identity authentication controls (login/logout) with principal ID display.",
  "frontend/src/components/SmartCompressor/SmartCompressor.tsx": "A file compression tool component supporting PDF and image formats, with configurable lossy/lossless settings, per-file status tracking, and usage limit enforcement.",
  "frontend/src/components/SubscriptionPanel.tsx": "A subscription management panel that shows free vs. Pro plan features, handles UPI payment flow via UTR submission, and displays verification status from the backend.",
  "frontend/src/components/Toolbox/BackgroundRemover.tsx": "A toolbox component that removes image backgrounds using a configurable tolerance slider, with before/after preview toggle and download support.",
  "frontend/src/components/Toolbox/MetadataScrubber.tsx": "A toolbox component that strips metadata (EXIF, GPS, author info) from images and PDFs in batch, with per-file status tracking and download of cleaned files.",
  "frontend/src/components/Toolbox/PDFMerger.tsx": "React component that allows users to upload, reorder, and merge multiple PDF files into one, with usage limit enforcement and a download button for the merged result.",
  "frontend/src/components/Toolbox/Toolbox.tsx": "Container component that renders a tool selector (PDF Merger, Background Remover, Metadata Scrubber) and displays the active tool's panel inside a GlassCard.",
  "frontend/src/components/UniversalConverter/UniversalConverter.tsx": "React component for converting files between formats (PDF, JPG, PNG, WEBP, DOCX, SVG), supporting batch conversion with per-file status tracking and download of results.",
  "frontend/src/contexts/FileContext.tsx": "React context that manages a per-tab registry of uploaded files, providing add, remove, clear, and get operations for files across different tool tabs.",
  "frontend/src/contexts/UsageContext.tsx": "React context that tracks daily tool usage against a limit of 4, syncing with the ICP backend when authenticated and falling back to localStorage for anonymous users, with pro-user bypass support.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, initializing it with the current Internet Identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom hook and provider that manage Internet Identity authentication via AuthClient, exposing login/logout functions, identity state, and login status to the component tree.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend actor interactions including verification status, UTR submission/approval, pro status, and daily usage queries.",
  "frontend/src/index.css": "Global CSS file setting up Tailwind, custom OKLCH dark theme tokens, glassmorphism utility classes, and a background image with overlay.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/backgroundRemoval.ts": "Client-side background removal utility that uses flood-fill from image corners to detect and make background pixels transparent, with edge smoothing.",
  "frontend/src/utils/compression.ts": "Image compression utility supporting lossy and lossless modes with binary-search quality tuning to hit percentage or max-KB targets.",
  "frontend/src/utils/conversion.ts": "File format conversion utility that converts images and PDFs between JPG, PNG, WEBP, SVG, and PDF formats using Canvas and dynamically loaded pdf.js.",
  "frontend/src/utils/metadataScrubber.ts": "Strips metadata from images (via canvas redraw) and PDFs (via pdf-lib) by clearing EXIF, GPS, author, and document properties.",
  "frontend/src/utils/pdfMerger.ts": "Merges multiple PDF files into a single PDF blob using pdf-lib loaded from a CDN.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH color palette (teal, violet, chart, sidebar), extended typography/container-queries/animate plugins, and custom font families.",
  "project_state.json": "Project state snapshot (version 31) describing a multi-tab file utility app with glassmorphism UI, ICP Internet Identity auth, UPI payment flow, admin panel access control, and a known issue with the daily uses counter not incrementing."
}